// Описание: вывод текстового сообщения в консоль.

#include <iostream> // Подключение класса потокового консольного ввода/вывода «iostream».
using namespace std; // Использование стандартного пространства имён.

int main() // «Базовая» функция «main()», в данном случае без аргументов.
{
  cout << "Hello World!" << endl; // Вывод в консоль сообщения «Hello World!» с помощью метода «cout» класса «iostream» и операции «<<», «endl» - символ конца строки.
  return 0; // Возвращение «базовой» функцией «main» целочисленного значения «0» в операционную систему.
}
